""" Напишите программу, которая будет преобразовывать десятичное число в двоичное."""

a = int(input('add number: '))
print(f'ваше число в двоичной системе равно =', bin(a)[2:])